#### ExternalResourceSubFolder Members

---

|  |
| --- |
| ExternalResourceSubFolder Class   Constructors   Methods   Properties   See Also |

The  ExternalResourceSubFolder  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalResourceSubFolder | Constructs a new ExternalResourceSubFolder with default values for folder name and icon path. |
| Public method | ExternalResourceSubFolder(String, String) | Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalResourceSubFolder |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FolderName | Folder displayed name. |
| Public property | IconPath | The path of the resource icon. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExternalResourceSubFolder Class

Autodesk.Revit.DB Namespace